namespace TestTask.Farm6.Store
{
    using System.Collections.Generic;
    using System.Data.Entity;
    using TestTask.Farm6.Models;

    public class AppDbInitializer : DropCreateDatabaseIfModelChanges<AppDbContext>
    {
        protected override void Seed(AppDbContext context)
        {
            var farms = new List<Farm>
            {
                new Farm("Поляков Авксентий Витальевич","ИП Поляков А.В.", "Томат", 765, 5, 93.64331303888336, 59.779744109795075, "Красноярский край"),
                new Farm("Мартынова Ия Гордеевна","ИП Мартынова И.Г.", "Картофель", 21554, 22, 55.93751427125856, 57.41384874911134, "Пермский край"),
                new Farm("Иван Иванович","ИП И.И.", "Морковь", 10045, 12, 56.48596068918444, 56.73118188976039, "Пермский край"),
                new Farm("Колобов Борис Макарович","ИП Колобов Б.М.", "Пшеница", 121212, 46, 52.78356811105943, 52.85204788877442, "Оренбургская область"),
                new Farm("Сафонов Альберт Юлианович","ИП Сафонов А.Ю.", "Подсолнух", 14456, 20, 49.77331420480944, 52.825502287776544, "Самарская область"),
                new Farm("Орехов Пётр Фёдорович","ИП Орехов П.Ф.", "Капуста", 5311, 31, 45.003377049798836, 56.937574619802575, "Нижегородская область"),
                new Farm("Афанасьев Юрий Игнатьевич","ИП Афанасьев Ю.И.", "Мак", 2118, 24, 41.80635556542383, 52.447742646250305, "Тамбовская область"),
                new Farm("Максимов Еремей Альвианович","ИП Максимов Е.А.", "Рис", 104000, 31, 39.235554784173814, 52.54806816153368, "Липецкая область"),
                new Farm("Коновалов Руслан Максимович","ИП Коновалов Р.М.", "Горох", 15167, 14, 45.693714215696495, 53.359467344300214, "Пензенская область"),
                new Farm("Беспалов Виктор Никитевич","ИП Беспалов В.Н.", "Кукуруза", 227419, 75, 44.72871884667376, 44.604276989670836, "Ставропольский край"),
                new Farm("Бирюков Филат Федосеевич","ИП Бирюков Ф.Ф.", "Картофель", 317212, 110, 53.359467344300214, 54.190467840271594, "Смоленская область"),
                new Farm("Ковалева Таисия Эдуардовна","ИП Ковалева Т.Э", "Томат", 45627, 38, 43.43233212792381, 49.93542016810204, "Волгоградская область"),
                new Farm("Рогов Даниил Донатович","ИП Рогов Д.Д.", "Огурец", 1148, 5, 44.880725934446666, 55.50598802823424, "Нижегородская область"),
                new Farm("Козлов Геласий Денисович","ИП Козлов Г.Д.", "Свекла", 3155, 41, 41.16734702819665, 54.34445260178808, "Рязанская область")
            };

            farms.ForEach(s => context.Farms.Add(s));
            context.SaveChanges();
        }
    }
}